views/worker/newworker.php

<u>Проект</u> <br><span style="font-size:0.9em;">(несколько,если "тайм менеджмент"=10)</span>
</div>
<div class="table_cell">
<?= Html::activeDropDownList($model, 'id',
      ArrayHelper::map(Project::find()->all(), 'id', 'name'), ['prompt'=>'Выберите']) ?>
---
SELECT * FROM `project`