controllers/WorkersController.php

    public function actionNewworker()
    {

       $model = new Workers();

       $model_project = new Projects();

       $model_workerproject = new Workersproject();

        if($model->load(\Yii::$app->request->post()) && $model->validate()) {

          $model->name = Yii::$app->request->post('Workers')['name'];
          $session = Yii::$app->session;
          $model->photo = $session->get('photo');
          $model->sociability = Yii::$app->request->post('Workers')['sociability'];
          $model->engineering = Yii::$app->request->post('Workers')['engineering'];
          $model->timemanagement = Yii::$app->request->post('Workers')['timemanagement'];
          $model->languages = Yii::$app->request->post('Workers')['languages'];
          $model->insert();

          $id_add_item = $model->find()->max('id');
          if(Yii::$app->request->post('Workers')['id_projects']) {
            if(strpos(Yii::$app->request->post('Workers')['id_projects'], '#') === false) {
               $model_workerproject->id_worker = $id_add_item;
               $model_workerproject->id_project = Yii::$app->request->post('Workers')['id_projects'];
               $model_workerproject->insert();
---
INSERT INTO `workers` (`name`, `photo`, `sociability`, `engineering`, `timemanagement`, `languages`) VALUES ('alex', 'img/20180912180519alex_image.jpg', 7, 9, 9, 7)
SELECT MAX(id) FROM `workers`
INSERT INTO `workersproject` (`id_worker`, `id_project`) VALUES (101, 2)

    public function actionListworkers($search = '')
    {

       $model = new Workers();

       $list = $model->find()
          ->select(['{{workers}}.[[id]]', '{{workers}}.[[name]]', '[[photo]]', '[[sociability]]', '[[engineering]]', '[[timemanagement]]', '[[languages]]', '{{projects}}.[[name]] as name_project', 'count({{workersproject}}.[[id_worker]]) as result'])
          ->leftJoin('{{workersproject}}', '{{workersproject}}.[[id_worker]] = {{workers}}.[[id]]')
          ->leftJoin('{{projects}}', '{{projects}}.[[id]] = {{workersproject}}.[[id_project]]')
          ->where(['like', '{{workers}}.[[name]]', $search])
          ->groupBy('{{workers}}.[[id]]')
          ->asArray()
          ->all();

      $average = $model->find()
          ->select(['round(sum([[sociability]])/count(*),2) as average_sociability', 'round(sum([[engineering]])/count(*),2) as average_engineering', 'round(sum([[timemanagement]])/count(*),2) as average_timemanagement', 'round(sum([[languages]])/count(*),2) as average_languages'])
          ->asArray()
          ->all();
---
SELECT `workers`.`id`, `workers`.`name`, `photo`, `sociability`, `engineering`, `timemanagement`, `languages`, `projects`.`name` AS `name_project`, count(`workersproject`.`id_worker`) as result FROM `workers` LEFT JOIN `workersproject` ON `workersproject`.`id_worker` = `workers`.`id` LEFT JOIN `projects` ON `projects`.`id` = `workersproject`.`id_project` WHERE `workers`.`name` LIKE '%%' GROUP BY `workers`.`id`
SELECT round(sum(`sociability`)/count(*),2) as average_sociability, round(sum(`engineering`)/count(*),2) as average_engineering, round(sum(`timemanagement`)/count(*),2) as average_timemanagement, round(sum(`languages`)/count(*),2) as average_languages FROM `workers`

    public function actionRemoveworker($id, $photo)
    {
       $model = new Workers();

       $model_workerproject = new Workersproject();

       $model->findOne($id)->delete();

       $model_workerproject->deleteAll('id_worker = :id_worker', [':id_worker' => $id]);
---
DELETE FROM `workers` WHERE `id`=96
SELECT * FROM `workers` WHERE `id`='96'
DELETE FROM `workersproject` WHERE id_worker = '96'