views/mylogin/index.php

SELECT `category_name`, `id` FROM `product_category`
---
    ?>

    <div class="form-group">alex - <b>Citadel</b>, serg - <b>Citadel-little</b> (serg - <b>87654321</b>)</div>
    <?= $form->field($model_, 'product_category')->dropdownList(
    $model_->find()->select(['category_name', 'id'])->indexBy('id')->column(),
    ['class' => 'select_field'])->label('Category', array('class'=>'title_select_field'));