views/workers/newworker.php

<u>Project</u> <br><span style="font-size:0.9em;">(several if "time management"=10)</span>
</div>
<div class="table_cell">
<?= Html::activeDropDownList($model, 'id',
      ArrayHelper::map(Projects::find()->all(), 'id', 'name'), ['prompt'=>'Select']) ?>
---
SELECT * FROM `projects`