models/Tree.php

public function showDom() {
fopen('filetemplate/categoryauto_template_array.php', 'r');
$array_template=file_get_contents('filetemplate/categoryauto_template_array.php');
$r1="/:{}/";
$r2="/:{/";
$r3="/{/";
$r4="/,/";
$r5="/}/";
$r6='/(\d+)((_(\d+))*)/';
$r7='/"/';
$dom_string=preg_replace($r1, '', $array_template);
$dom_string=preg_replace($r2, '<ul><li>', $dom_string);
$dom_string=preg_replace($r3, '<ul><li>', $dom_string);
$dom_string=preg_replace($r4, '</li><li>', $dom_string);
$dom_string=preg_replace($r5, '</li></ul>', $dom_string);
$dom_string=preg_replace($r6, '<img src="filetemplate/update.jpg" name="$1$2#" alt />&nbsp;<?php if($out_[\'$4\']) echo \'<span name="level_title_$1$2#">\'.$out_[\'$4\'].\'&nbsp;</span>\'; else echo \'<span name="level_title_$1$2#">\'.$out_[\'$1\'].\'&nbsp;</span>\'; ?><img src="filetemplate/add.png" name="$1$2#" alt />&nbsp;<?php if($out_[\'$4\']) echo \'<img src="filetemplate/delete.png" name="$1$2#" alt />\'; ?>', $dom_string);
$dom_string=preg_replace($r7, '', $dom_string);
fopen('filetemplate/categoryauto_template_dom.php', 'w');
file_put_contents('filetemplate/categoryauto_template_dom.php', $dom_string);
$row_db=$this->find()->asArray()->all();
---
SELECT * FROM `tree`